itaejin/stm32-gas-supply-system/test2/gas_test1/Core/Inc/TS_commu.h
#include "stm32f1xx_hal.h"

typedef enum { GasGood=0, GasWait, GasInSupply, GasPrepReplace, GasAlarmReplace=4 } GasGaugeLamp_t;  
typedef enum { NoFlow = 0, Flow = 8 } GasFlowLampVel_t;
typedef enum { MorePrepReplace = 8, PrepReplace = 7, AlarmReplace = 6 } GasLamp_t;
typedef enum { Splash = 10, Main = 11, Config = 41, Alarm = 45, PW_Input = 111, PW_Change = 112, PW_Wrong = 113, PW_Change_OK = 114, AlertAlarm = 120 } Window_t;

typedef struct {
	uint16_t Value;
	uint16_t Low;			// GasAlarmReplace
	uint16_t LowLow;		// GasPrepReplace
	uint16_t Offset;
	uint16_t MinSValue;		// Min. Value of Sensor
	uint16_t MaxSValue;		// Max. Value of Sensor
	uint16_t MaxValue;		// Max. Value of Gas Chaeging
	GasLamp_t GasLamp;
	uint16_t Reserved[2];
} DataPT12_t;

typedef struct {
	uint16_t Value;
	uint16_t MinSValue;		// Min. Supply Value
	uint16_t Reserved;
	uint16_t Offset;
	uint16_t MaxSValue;		// Max. Value of Sensor
	uint16_t Reserved2;
} DataPT3_t;

typedef struct {
	uint16_t BSVelL;	// Before Solenoid Velocity Left (GasFlowLampVel_t)
	uint16_t BSLampL;	// Before Solenoid Lamp Left (GasLamp_t)
	uint16_t ASVelL;	// After Solenoid Velocity Left
	uint16_t ASLampL;	// After Solenoid Lamp Left
	uint16_t BSVelR;	// Before Solenoid Velocity Right
	uint16_t BSLampR;	// Before Solenoid Lamp Right
	uint16_t ASVelR;	// After Solenoid Velocity Right
	uint16_t ASLampR;	// After Solenoid Lamp Right
	uint16_t MVel;		// After Solenoid Velocity Right
	uint16_t MLamp;		// After Solenoid Lamp Right
} FlowLamp_t;

typedef struct {
	uint16_t Value;
	uint16_t LowLimit;		// GasAlarmReplace
	uint16_t UpperLimit;	// GasPrepReplace
	uint16_t TargetValue;	// GasPrepReplace
	uint16_t MinValue;		// Min. Value of Sensor
	uint16_t MaxValue;		// Max. Value of Gas Chaeging
} GasGraph_t;

typedef struct {
	uint16_t CurValue;		// 비밀번호 현재 
	uint16_t SavedValue;	// 비밀번호 저장
	uint16_t ChangedValue;	// 비밀번호 변경
} Password_t;

#pragma pack(push,1)
typedef struct{
	unsigned MainWinSW:1;		// 1 --> 0
	unsigned rsvd01:1;		
	unsigned ConfigWinSW:1;		// 3 --> 2
	unsigned rsvd04_08:5;
	unsigned AlarmWinSW:1;		// 9 --> 8
	unsigned SupplyGasLSW:1;	// 10 --> 9
	unsigned StopGasLSW:1;		// 11 --> 10
	unsigned rsvd12_19:8;
	unsigned SupplyGasRSW:1;	// 20 --> 19
	unsigned StopGasRSW:1;		// 21 --> 20
	unsigned rsvd022_29:8;
	unsigned AlarmResetSW:1;	// 30 --> 29
	unsigned rsvd031_46:16;
	unsigned rsvd047_62:16;
	unsigned rsvd063_78:17;
	unsigned rsvd079:1;
	unsigned SolNoNCSW:1;		// 80 --> 79
	unsigned UseBuzzerSW:1;		// 81 --> 80
	unsigned rsvd82_89:8;
	unsigned InputPWSW:1;		// 90 --> 89
	unsigned ConfirmPWSW:1;		// 91 --> 90
	unsigned OpenWinPWSW:1;		// 92 --> 91
	unsigned rsvd93_100:8;
	
	unsigned MainWinLamp:1;			// 101 --> 0
	unsigned rsvd101:1;		
	unsigned ConfigWinLamp:1;		// 103 --> 2
	unsigned rsvd104_108:5;
	unsigned AlarmWinLamp:1;		// 109 --> 8
	unsigned SupplyGasLLamp:1;		// 110 --> 9
	unsigned StopGasLLamp:1;		// 111 --> 10
	unsigned rsvd112_119:8;
	unsigned SupplyGasRLamp:1;		// 120 --> 19
	unsigned StopGasRLamp:1;		// 121 --> 20
	unsigned rsvd0122_129:8;
	unsigned AlarmReseLampW:1;		// 130 --> 29
	unsigned rsvd0131_146:16;
	unsigned rsvd0147_162:16;
	unsigned rsvd0163_178:16;
	unsigned rsvd0179:1;
	unsigned SolNoNCLamp:1;			// 180 --> 79
	unsigned UseBuzzerLamp:1;		// 181 --> 80
	unsigned rsvd182_189:8;
	unsigned InputPWLamp:1;			// 190 --> 89
	unsigned ConfirmPWLamp:1;		// 191 --> 90
	unsigned OpenWinPWLamp:1;		// 192 --> 91
	unsigned rsvd193_199:7;
	
	unsigned EmerSWOnLamp:1;		// 200 --> 199 --> 201
	unsigned SubEmerSWOnLamp:1;		// 201 --> 200 --> 202
	unsigned PressureLowLimit:1;	// 202 --> 201 --> 203
	unsigned PrepChgPT1:1;			// 203 --> 202 --> 204
	unsigned PrepChgPT1Alarm:1;		// 204 --> 203 --> 205
	unsigned PrepChgPT2:1;			// 205 --> 204 --> 206
	unsigned PrepChgPT2Alarm:1;		// 206 --> 205 --> 207
	unsigned MinSuuplPressPT3:1;	// 207 --> 206 --> 208
	unsigned rsvd208:1;
	unsigned rsvd209_224:16;
	unsigned rsvd225_240:16;
} IO_t;

#pragma pack(pop)

typedef struct {
	uint8_t GasName[12];
	uint8_t GasUnit[6];
	uint16_t Password;
	uint16_t PT1Data[6];	
	// [0]Low-GasAlarmReplace, [1]LowLow-GasPrepReplace, [2]Offset, 
	// [3]MinSValue / [4]MaxSValue - Min./Max. Value of Sensor, [5]MaxValue-Max. Value of Gas Chaeging
	uint16_t PT2Data[6];
	uint16_t PT3Data[4];
	// [0]MinSValue-Min. Supply Value. [1]Reserved, [2]Offset, [3]MaxSValue- Max. Value of Sensor
	uint32_t dummy;
} FlashParam_t;

extern DataPT12_t PT1, PT2;
extern UART_HandleTypeDef huart3;

void init_TS_commu();
void start_TS_commu();
uint16_t CRC16 (const uint8_t *nData, uint16_t wLength);
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart);
void process_tim2_interrupt();

extern FlashParam_t fParam;

HAL_StatusTypeDef EraseFlash();
HAL_StatusTypeDef WriteFlash(uint32_t *pData32);
HAL_StatusTypeDef ReadFlash(uint32_t *pData32);
extern uint8_t TestFlash;
extern uint32_t FlashData;

// 🆕 시뮬레이션 모드 변수 extern 선언
extern uint8_t simulation_mode;
extern uint8_t auto_switch_enabled;

// 👇 여기에 추가
void SaveFlashParam(void);  // 새로 추가할 함수 선언
void ReadFlashParam(void);
void UpdateGraphSettings(void);
